// SysCfg.h: System Configuration for VI. Kim JinWoo, 2007-11-18.

#ifndef SYSCFG_H
#define SYSCFG_H

typedef struct CFG_SETUP_Tag
{
	char arcIdH[2];
	char arcVer[2];
	U16  uLen;

	///////////////////////////////////////////
	U08 bCarType;              	// 12h, 0
	U08 bCenterX;              	// 13h, 140~180 pixel
	U08 bCenterY;              	// 14h, 100~140 pixel
	U08 bKph_Hi;               	// 15h,  50~100 kph
	U08 bKph_Lo;               	// 16h,   0~ 20 kph
	U08 bKph_Delay;            	// 17h,   0~200 0.1sec
	S08 cLdwsStepL;            	// 18h,  -5~ +5 step
	S08 cLdwsStepR;            	// 19h,  -5~ +5 step
	U08 bWiper_Delay;          	// 1Ah,   0~100 0.1sec
	U08 bTurn_Delay;           	// 1Bh,   0~100 0.1sec
	U08 bCalibration_Result;   	// 1Ch, 0(=수행않됨), 1(수행후 성공), 2(수행후 실패)
	U08 bTestMode_Result;      	// 1Dh, 0(=수행않됨), 1(수행후 성공), 2(수행후 실패)

	U08 bAutoCode;             	// 1Eh: 0(한국(KOR)), 1(미국(USA)), 2(중국(CHN)), 3(유럽(EUR))
	U08 bAutoCode_Result;
	U08 bHandleCode;           	// 1Fh: 0(왼쪽(LHD)), 1(오른쪽(RHD))
	U08 bHandleCode_Result;
	U08 bLdwsSWSave;           	// ISG 정지시 스위치 Last Memory
	U08 bCarKeyBtnStatus;	  	// KEY 상태값 저장 변수.	2011-10-28
//   U08 bLdwsSWSave_Result;
//   U08 bHapticStatus;         // Haptic swich signal On/Off  // 10.02.09 <CWR>
//   U08 bHapticStatusSave;     // Haptic swich signal On/Off
//   U08 bTemp_Rsv8;
//   U08 bTemp_Rsv9;
//   U08 bTemp_Rsv10;

//   U08 arbRsv1[32-12];        // Reserved for future
//   U08 arbRsv1[32-24];        // Reserved for future
//   U08 arbRsv1[32-17];        // Reserved for future
   	U08 arbRsv1[32-18]; 		// Reserved for future

	U08 arbVIN[11];                                             	// 90H, "XXXXXXXXXXX"

	// U08 arbECUIdentificationDataTable[11];                      	// 80h, "VI LDWS A.A"
	U08 arbECUIdentificationDataTable[21];                      	// 80h, "VI USA LDWS 1.1 XXXXX" // 09.07

	U08 arbCalibrationRepairShopCodeOrTesterSerialNumber[10];   	// 8Ah, "XXXXXXXXXX"
	U08 arbCalibrationProgrammingDate[4];                       	// 8Bh, Yh,Yl,M,D
	U08 arbSubSystemBootSoftwareNumber[4];                      	// 8Ch, "1234". 1.2.34
	U08 arbSubSystemECUSoftwareNumber[4];                       	// 8Dh, "1234". 1.2.34

	U08 arbSystemSupplierECUHardwareNumber[4];                  	// 92h, "1234". 1.2.34
	U08 arbRepairShopCodeOrTesterSerialNumber[10];              	// 98h, "XXXXXXXXXX"
	U08 arbProgrammingDate[4];                                  	// 99h, Yh,Yl,M,D

	// U08 arbRsv2[128-102];                                       	// sizeof(CFG_SETUP) = 128
	U08 arbRsv2[128-112];                                       	// sizeof(CFG_SETUP) = 128 // 09.07
	/////////////////////////////////////////////////////////
	char arcIdT[2];
} CFG_SETUP;

typedef enum _SYSTEM_MODE_Tag
{
	_NONE = 0,
	_CAN_CYCLE_SET,
	_UDS_SESSION_SETTING_MODE,
	_UDS_STOP_SESSION_MODE,
	_UDS_READ_DTC_STATUS_PRESENT_MODE,
	_UDS_READ_DTC_STATUS_ALL_MODE,
	_UDS_READ_DTC_FAILURE_MODE,
	_UDS_READ_STATUS_DTC_MODE,
	_UDS_CLEAR_DTC_INFOMATION_MODE,
	_UDS_CONTROL_DTC_ON_MODE,
	_UDS_CONTROL_DTC_OFF_MODE,
	_UDS_SUSPEND_COMMUNICATION_ON_MODE,
	_UDS_SUSPEND_COMMUNICATION_OFF_MODE,
	_UDS_SEED_REQUEST_MODE,
	_UDS_SEED_SEND_MODE,
	_UDS_READ_DATA_COMMON_MODE,
	_UDS_READ_DATA_LOCAL_MODE,
	_UDS_WRITE_DATA_COMMON_MODE,
	_UDS_WRITE_DATA_LOCAL_MODE,
	_UDS_IO_CONTROL_MODE,
	_UDS_ECU_RESET_MODE,
	_UDS_TESTER_PRESENT_MODE,
	_UDS_AS_CALIBRATION_MODE,
	_UDS_INLINE_CALIBRATION_MODE,
	_UDS_CAPTURE_MODE,
	_UDS_FWUPDATE_MODE,
	_UDS_READ_ECU_ECU_ID_TABLE_MODE,
	_UDS_READ_ECU_CAL_RE_SERIAR_NUM_MODE,
	_UDS_READ_ECU_CAL_PROG_DATE_MODE,
	_UDS_READ_ECU_BOOT_SW_NUM_MODE,
	_UDS_READ_ECU_ECU_SW_NUM_MODE,
	_UDS_READ_ECU_VIN_MODE,
	_UDS_READ_ECU_ECU_HW_NUM_MODE,
	_UDS_READ_ECU_RE_SERIAR_NUM_MODE,
	_UDS_READ_ECU_PROG_DATE_MODE,
	_UDS_READ_DATA_VEHICLETYPE_MODE,
	_UDS_READ_DATA_AUTOCODE_MODE,
	_UDS_READ_DATA_HANDLECODE_MODE,
	_UDS_READ_DATA_CALRESULT_MODE,
	_UDS_READ_DATA_CARHEIGHT_MODE,
	_UDS_READ_DATA_CARWIDTH_MODE,
	_UDS_READ_DATA_CAMERAOFFSET_MODE,
	_UDS_READ_DATA_HOODLENGHT_MODE,
	_UDS_READ_DATA_VANISHX_MODE,
	_UDS_READ_DATA_VANISHY_MODE,
	_UDS_READ_DATA_LDKHI_MODE,
	_UDS_READ_DATA_LDKLO_MODE,
	_UDS_READ_DATA_FCKHI_MODE,
	_UDS_READ_DATA_FCKLO_MODE,
	_UDS_READ_DATA_LDSTEPL_MODE,
	_UDS_READ_DATA_LDSTEPR_MODE,
	_UDS_READ_DATA_SETCAMERASTARTY_MODE,
	_UDS_READ_DATA_LDKW_TABLE_MODE,
	_UDS_READ_DATA_FCKW_MODE,
	_UDS_READ_DATA_LDSENSLEVELLEFT_MODE,
	_UDS_READ_DATA_LDSENSLEVELRIGHT_MODE,
	_UDS_READ_DATA_FCSENSLEVELHMW_MODE,
	_UDS_READ_DATA_FCSENSLEVELHMWSET_MODE,
	_UDS_READ_DATA_FCSENSLEVELFCW_MODE,
	_UDS_READ_DATA_FCSENSLEVELFCWSET_MODE,
	_UDS_READ_DATA_LUMATHRESHOLD_MODE,
	_UDS_READ_DATA_LUMATHRESHOLDDAY_MODE,
	_UDS_READ_DATA_LUMATHRESHOLDNIGHT_MODE,
	_UDS_READ_DATA_LUMADELAYDAY_MODE,
	_UDS_READ_DATA_LUMADELAYNIGHT_MODE,
	_UDS_READ_DATA_ECU_ID_TABLE_MODE,
	_UDS_READ_DATA_CAL_RE_SERIAR_NUM_MODE,
	_UDS_READ_DATA_CAL_PROG_DATE_MODE,
	_UDS_READ_DATA_VIN_MODE,
	_UDS_READ_DATA_RE_SERIAR_NUM_MODE,
	_UDS_READ_DATA_PROG_DATE_MODE,
	_UDS_READ_DATA_ECU_ID_MODE,
	_UDS_WRITE_DATA_VEHICLETYPE_MODE,
	_UDS_WRITE_DATA_AUTOCODE_MODE,
	_UDS_WRITE_DATA_HANDLECODE_MODE,
	_UDS_WRITE_DATA_CALRESULT_MODE,
	_UDS_WRITE_DATA_CARHEIGHT_MODE,
	_UDS_WRITE_DATA_CARWIDTH_MODE,
	_UDS_WRITE_DATA_CAMERAOFFSET_MODE,
	_UDS_WRITE_DATA_HOODLENGHT_MODE,
	_UDS_WRITE_DATA_VANISHX_MODE,
	_UDS_WRITE_DATA_VANISHY_MODE,
	_UDS_WRITE_DATA_LDKHI_MODE,
	_UDS_WRITE_DATA_LDKLO_MODE,
	_UDS_WRITE_DATA_FCKHI_MODE,
	_UDS_WRITE_DATA_FCKLO_MODE,
	_UDS_WRITE_DATA_LDSTEPL_MODE,
	_UDS_WRITE_DATA_LDSTEPR_MODE,
	_UDS_WRITE_DATA_SETCAMERASTARTY_MODE,
	_UDS_WRITE_DATA_LDKW_MODE,
	_UDS_WRITE_DATA_FCKW_MODE,
	_UDS_WRITE_DATA_LDSENSLEVELLEFT_MODE,
	_UDS_WRITE_DATA_LDSENSLEVELRIGHT_MODE,
	_UDS_WRITE_DATA_FCSENSLEVELHMW_MODE,
	_UDS_WRITE_DATA_FCSENSLEVELHMWSET_MODE,
	_UDS_WRITE_DATA_FCSENSLEVELFCW_MODE,
	_UDS_WRITE_DATA_FCSENSLEVELFCWSET_MODE,
	_UDS_WRITE_DATA_LUMATHRESHOLD_MODE,
	_UDS_WRITE_DATA_LUMATHRESHOLDDAY_MODE,
	_UDS_WRITE_DATA_LUMATHRESHOLDNIGHT_MODE,
	_UDS_WRITE_DATA_LUMADELAYDAY_MODE,
	_UDS_WRITE_DATA_LUMADELAYNIGHT_MODE,
	_UDS_WRITE_DATA_ECU_ID_TABLE_MODE,
	_UDS_WRITE_DATA_CAL_RE_SERIAR_NUM_MODE,
	_UDS_WRITE_DATA_CAL_PROG_DATE_MODE,
	_UDS_WRITE_DATA_VIN_MODE,
	_UDS_WRITE_DATA_RE_SERIAR_NUM_MODE,
	_UDS_WRITE_DATA_PROG_DATE_MODE,
	_UDS_WRITE_DATA_ECU_ID_MODE
} _SYSTEM_MODE_LIST;

typedef enum _SYSTEM_CAN_ID_Tag
{
	_IN_CAN_SIG1		= 0x0410,
	_IN_CAN_SIG2		= 0x0171,
	_IN_CAN_SIG3		= 0x0395,
	_IN_CAN_SIG4		= 0x01B3,
	_IN_CAN_SIG5		= 0x0020,
	_IN_CAN_SIG6		= 0x0030,
	_IN_CAN_SIG7		= 0x0040,
	_OUT_CAN_STATUS		= 0x0495,
	_OUT_CAN_LANE		= 0x0496,
	_OUT_CAN_CIPV		= 0x0497,
	_OUT_CAN_LANE_C		= 0x0498,
	_OUT_CAN_CIPV_C		= 0x0499,
	_OUT_CAN_SIGN		= 0x049A,
	_OUT_CAN_OBJECT		= 0x049B,
	_OUT_CAN_OBJECT_C	= 0x049C,
	_CAN_ID_DTC_MASTER	= 0x07DF,
	_CAN_ID_DTC_TESTER	= 0x0740,
	_CAN_ID_DTC_ECU		= 0x0748
} _SYSTEM_CAN_ID;

typedef enum _TEST_MODE_Tag
{
	_TEST_NONE = 0,
	_SPEED_ON_MODE,
	_SPEED_OFF_MODE,
	_TURN_LEFT_MODE,
	_TURN_RIGHT_MODE,
	_WARNING_LEFT_MODE,
	_WARNING_RIGHT_MODE,
	_TURN_WARNING_LEFT_MODE,
	_TURN_WARNING_RIGHT_MODE,
	_WIPER_WARNING_LEFT_MODE,
	_WIPER_WARNING_RIGHT_MODE,
	_START_STATE_MODE,
	_CAMERA_DTC_MODE,
	_CAL_DTC_MODE,	
	_CAN_IN_ERR_MODE,
	_VOLTAGE_HIGH_MODE,
	_VOLTAGE_LOW_MODE
} _TEST_MODE_LIST;

#endif // SYSCFG_H


